{
  "name": "Esoteric Engine Overhaul",
  "description": "Refonte complete du moteur esoterique de Quantum Oracle : migration des donnees en base Neon, mapping bit-par-bit natif (16 octets QRNG → 13 traditions), enrichissement des 7 traditions existantes, ajout de 6 nouvelles traditions (Ifa, Geomancie, Runes, Alchimie, Chakras/Solfege, Gematria), mise a jour des prompts LLM et reorganisation complete de l'UI.",
  "branchName": "feat/esoteric-engine-overhaul",
  "userStories": [
    {
      "id": "US-001",
      "title": "Concevoir et creer le schema Drizzle pour les traditions esoteriques",
      "description": "En tant que developpeur, je veux un schema de base de donnees complet pour toutes les traditions esoteriques afin de remplacer les fichiers TypeScript statiques par des donnees en base Neon.",
      "acceptanceCriteria": [
        "Table iching_trigrams creee (8 entrees) : id, index (0-7), name, symbol, element, attribute, binary_repr, description, correspondences (JSONB)",
        "Table iching_hexagrams creee (64 entrees) : id, number (1-64), name, symbol, upper_trigram_id (FK), lower_trigram_id (FK), meaning, judgment_text, image_text, mutating_lines (JSONB array de 6 lignes), correspondences (JSONB)",
        "Table tarot_major_arcana creee (22 entrees) : id, number (0-21), name, symbol, meaning, keywords (JSONB array), upright_meaning, reversed_meaning, astrological_sign, element, hebrew_letter, path_on_tree, description, symbolism",
        "Table kabbalah_sefirot creee (10 entrees) : id, number (1-10), name, hebrew, meaning, attribute, divine_name, archangel, planet, color, element, description, correspondences (JSONB)",
        "Table kabbalah_paths creee (22 entrees) : id, number (1-22), hebrew_letter, letter_name, from_sefirah_id (FK), to_sefirah_id (FK), tarot_arcana_id (FK), meaning, zodiac_or_planet, element, description",
        "Table hermetic_principles creee (7 entrees) : id, number (1-7), name, axiom, meaning, deep_commentary, historical_context, correspondences (JSONB)",
        "Table elements creee (4 entrees) : id, name, symbol, qualities, direction, season, temperament, zodiac_signs (JSONB), correspondences (JSONB)",
        "Table ifa_odu creee (256 entrees) : id, number (0-255), name, binary_signature (8 chars), meaning, proverbs (JSONB array), ese_ifa_verses (JSONB array), orisha, prescriptions, interdictions, element, correspondences (JSONB)",
        "Table geomancy_figures creee (16 entrees) : id, number (0-15), name_arabic, name_latin, binary_signature (4 chars), element, planet, zodiac_sign, meaning, reversed_meaning, judge_role, correspondences (JSONB)",
        "Table elder_futhark_runes creee (24 entrees) : id, number (0-23), name, glyph, phonetic_value, aett_number (1-3), meaning, merkstave_meaning, element, deity, description, correspondences (JSONB)",
        "Table alchemy_stages creee (4 entrees) : id, number (0-3), name, latin_name, color, planet, description, symbolism, correspondences (JSONB)",
        "Table alchemy_operations creee (7 entrees) : id, number (0-6), name, latin_name, planet, description, stage_id (FK)",
        "Table chakras creee (7 entrees) : id, number (0-6), name_sanskrit, name_french, location, color, element, mantra, solfege_frequency, function_desc, description, correspondences (JSONB)",
        "Table solfege_frequencies creee (9 entrees) : id, frequency_hz, name, digital_root, description, healing_property",
        "Table hebrew_letters creee (22 entrees) : id, number (1-22), letter, name, phonetic_value, numerical_value, meaning, path_id (FK kabbalah_paths), mother_double_simple (enum), element_or_planet_or_zodiac, description",
        "Table tradition_correspondences creee : id, source_tradition, source_id, target_tradition, target_id, relationship_type, description",
        "Toutes les FK et index necessaires sont definis",
        "Les types TypeScript sont inferes via $inferSelect / $inferInsert",
        "Le fichier schema est dans src/db/schema.ts (extension de l'existant)",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 1,
      "passes": false,
      "labels": ["database", "schema", "foundation"],
      "dependsOn": [],
      "notes": "Fondation du projet. Toutes les autres stories en dependent. Etendre le fichier src/db/schema.ts existant qui contient deja users, subscriptions, consultations et dailyUsage. Utiliser Drizzle ORM avec pgTable, jsonb, uuid, integer, text, pgEnum."
    },
    {
      "id": "US-002",
      "title": "Creer le Data Access Layer (DAL) pour les traditions esoteriques",
      "description": "En tant que developpeur, je veux une couche d'acces aux donnees qui abstrait les requetes DB pour chaque tradition, avec cache en memoire, afin que le moteur d'interpretation puisse lire les donnees sans connaitre Drizzle.",
      "acceptanceCriteria": [
        "Module src/lib/esoteric-dal.ts cree",
        "Fonction getTrigramByIndex(index: number) retourne un trigram par son index binaire (0-7)",
        "Fonction getHexagramByNumber(number: number) retourne un hexagramme avec ses trigrammes joints",
        "Fonction getTarotArcana(number: number) retourne un arcane avec ses correspondances",
        "Fonction getSefirah(number: number) retourne une sefirah avec ses chemins adjacents",
        "Fonction getKabbalahPath(number: number) retourne un chemin avec ses sefirot et arcane lies",
        "Fonction getHermeticPrinciple(number: number) retourne un principe avec commentaire profond",
        "Fonction getElement(name: string) retourne un element avec correspondances",
        "Fonction getOdu(number: number) retourne un Odu avec versets et correspondances",
        "Fonction getGeomancyFigure(number: number) retourne une figure geomantique",
        "Fonction getRune(number: number) retourne une rune avec merkstave",
        "Fonction getAlchemyStage(number: number) retourne un stade alchimique",
        "Fonction getAlchemyOperation(number: number) retourne une operation alchimique",
        "Fonction getChakra(number: number) retourne un chakra avec frequence solfege",
        "Fonction getSolfegeFrequency(digitalRoot: number) retourne une frequence par racine numerique",
        "Fonction getHebrewLetter(number: number) retourne une lettre hebraique",
        "Fonction decomposeGematria(value: number) decompose un nombre (0-255) en somme de lettres hebraiques",
        "Fonction getCorrespondences(tradition: string, id: number) retourne les correspondances croisees",
        "Cache LRU en memoire avec TTL configurable pour eviter des requetes repetees",
        "Toutes les fonctions sont typees avec les types inferes du schema Drizzle",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 1,
      "passes": false,
      "labels": ["backend", "dal", "foundation"],
      "dependsOn": ["US-001"],
      "notes": "Le DAL abstrait Drizzle pour le moteur d'interpretation. Utilise src/db/index.ts pour la connexion DB existante. Le cache LRU est critique car les donnees esoteriques sont statiques (TTL 1h+). Pas de nouvelle dependance npm — implementer un cache simple avec Map + timestamps."
    },
    {
      "id": "US-003",
      "title": "Enrichir et seeder les donnees Yi Jing",
      "description": "En tant qu'utilisateur, je veux que les hexagrammes et trigrammes du Yi Jing contiennent des descriptions profondes, des textes du Jugement et de l'Image, et les 6 lignes mutantes pour chaque hexagramme, afin que l'interpretation soit riche et fidele a la tradition.",
      "acceptanceCriteria": [
        "8 trigrammes seedes avec : nom chinois + francais, symbole Unicode, element, attribut, direction, saison, partie du corps, animal, description detaillee (100+ mots)",
        "64 hexagrammes seedes avec : nom chinois + francais, symbole Unicode, texte du Jugement (Tuan), texte de l'Image (Xiang), signification generale (150-200 mots)",
        "Chaque hexagramme a 6 lignes mutantes (texte par ligne), chacune avec son sens propre quand elle mute",
        "Les correspondances croisees sont renseignees : hexagramme vers arcane du Tarot (via King Wen), hexagramme vers element",
        "Script de seed : src/db/seeds/seed-iching.ts",
        "Le seed est idempotent (upsert, pas d'erreur si execute plusieurs fois)",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["data", "seed", "iching"],
      "dependsOn": ["US-001"],
      "notes": "Sources de reference : Wilhelm/Baynes (traduction classique), Legge. 64 hexagrammes x 6 lignes mutantes = 384 textes de lignes en plus des 64 significations generales. Les donnees actuelles dans src/data/esoteric/iching.ts contiennent deja les 8 trigrammes et 64 hexagrammes mais avec des descriptions courtes et sans lignes mutantes."
    },
    {
      "id": "US-004",
      "title": "Enrichir et seeder les donnees Tarot des Arcanes Majeurs",
      "description": "En tant qu'utilisateur, je veux que les 22 arcanes majeurs contiennent une symbolique riche (sens droit/inverse, correspondances astrologiques, lettres hebraiques, chemins sur l'Arbre de Vie) afin que chaque arcane soit un portail de sagesse complet.",
      "acceptanceCriteria": [
        "22 arcanes seedes avec : nom, symbole/emoji, sens droit (150-200 mots), sens inverse (100-150 mots), 5-7 mots-cles",
        "Correspondances astrologiques renseignees pour chaque arcane (planete ou signe zodiacal)",
        "Correspondance avec la lettre hebraique du chemin kabbalistique (tradition du Golden Dawn)",
        "Element associe renseigne (Feu, Eau, Air, Terre ou combinaison)",
        "Chemin sur l'Arbre de Vie reference (lie a kabbalah_paths)",
        "Description du symbolisme visuel de la carte (150+ mots, basee sur le Rider-Waite-Smith)",
        "Script de seed : src/db/seeds/seed-tarot.ts",
        "Le seed est idempotent",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["data", "seed", "tarot"],
      "dependsOn": ["US-001"],
      "notes": "Les donnees actuelles dans src/data/esoteric/tarot.ts contiennent les 22 arcanes avec nom, emoji, meaning court et 3 keywords. Le Tarot a des FK vers kabbalah_paths — seeder apres US-005 si possible, sinon laisser path_on_tree nullable et remplir dans US-015."
    },
    {
      "id": "US-005",
      "title": "Enrichir et seeder les donnees Kabbale (Sefirot + 22 Chemins)",
      "description": "En tant qu'utilisateur, je veux que l'Arbre de Vie contienne les 10 Sefirot avec leurs attributs divins complets et les 22 chemins avec les correspondances du Sefer Yetzirah (lettres hebraiques, planetes, zodiac, elements), afin de pouvoir naviguer l'Arbre dans toute sa profondeur.",
      "acceptanceCriteria": [
        "10 Sefirot seedes avec : nom hebreu + translitteration + francais, attribut divin, nom de Dieu associe, archange, planete/astre, couleur, element, position sur l'Arbre (pilier, monde), description detaillee (200+ mots)",
        "22 chemins seedes avec : numero, lettre hebraique, nom de la lettre, sefirot de depart et d'arrivee (FK), arcane du Tarot associe (FK), signe zodiacal / planete / element (selon le Sefer Yetzirah), categorie (3 meres, 7 doubles, 12 simples), description (150+ mots)",
        "Les correspondances croisees Sefirot <-> Planetes <-> Arcanes sont coherentes avec la tradition du Golden Dawn",
        "Script de seed : src/db/seeds/seed-kabbalah.ts",
        "Le seed est idempotent",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["data", "seed", "kabbalah"],
      "dependsOn": ["US-001"],
      "notes": "Les donnees actuelles dans src/data/esoteric/kabbalah.ts contiennent les 10 Sefirot avec nom, hebrew, meaning et attribute — tres sommaire. Les 22 chemins n'existent pas du tout. Le Sefer Yetzirah definit 3 lettres meres (Aleph, Mem, Shin), 7 doubles (Beth, Gimel, Daleth, Kaph, Pe, Resh, Tav) et 12 simples."
    },
    {
      "id": "US-006",
      "title": "Enrichir et seeder Hermetisme, Elements, Geometrie Sacree et Synthese",
      "description": "En tant qu'utilisateur, je veux que les principes hermetiques, les elements classiques, la geometrie sacree et la synthese cosmique soient enrichis avec un contexte historique profond et des correspondances, afin de depasser les descriptions superficielles actuelles.",
      "acceptanceCriteria": [
        "7 principes hermetiques seedes avec : nom, axiome du Kybalion, signification (200+ mots), commentaire historique (reference au Corpus Hermeticum, Tabula Smaragdina), application pratique, correspondances (planete, metal, jour de la semaine)",
        "4 elements seedes avec : nom, symbole (Unicode alchimique), qualites (chaud/froid, sec/humide), direction cardinale, saison, temperament (sanguin/colerique/melancolique/flegmatique), signes zodiacaux associes (3 par element), correspondances avec chakras, Sefirot et planetes",
        "Constantes de geometrie sacree enrichies : Phi, Fibonacci, Pi, racine de 2, nombre d'argent, avec signification mathematique et symbolique pour chaque constante",
        "12 tons cosmiques enrichis avec correspondance astrologique (12 signes), element, modalite (cardinal/fixe/mutable)",
        "Scripts de seed : src/db/seeds/seed-hermetic.ts, src/db/seeds/seed-elements.ts, src/db/seeds/seed-sacred-geometry.ts, src/db/seeds/seed-synthesis.ts",
        "Tous les seeds sont idempotents",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["data", "seed", "hermetic", "elements"],
      "dependsOn": ["US-001"],
      "notes": "Regroupe 4 traditions mineures en volume. Fichiers actuels : src/data/esoteric/hermetic.ts (7 principes courts), src/data/esoteric/elements.ts (4 elements), src/data/esoteric/sacred-geometry.ts (Phi + Fibonacci), src/data/esoteric/synthesis.ts (12 tons cosmiques)."
    },
    {
      "id": "US-007",
      "title": "Creer et seeder les 256 Odu d'Ifa (corpus complet)",
      "description": "En tant qu'utilisateur, je veux que le systeme Ifa soit integre avec ses 256 Odu et leur corpus academique complet (versets Ese Ifa, proverbes, Orisha, prescriptions/interdictions), car c'est le systeme de divination binaire le plus ancien qui utilise exactement 8 bits — un mapping 1:1 parfait avec un octet QRNG.",
      "acceptanceCriteria": [
        "256 Odu seedes avec : numero (0-255), nom Yoruba, signature binaire (8 caracteres, ex: 11111111 pour Eji Ogbe), rang hierarchique",
        "Chaque Odu a une signification generale (150-200 mots)",
        "Au minimum 2-3 proverbes Yoruba par Odu (avec traduction francaise)",
        "Au minimum 1-2 versets Ese Ifa par Odu (resume narratif en francais, 100-200 mots chacun)",
        "Orisha (divinite) patron associe a chaque Odu",
        "Prescriptions (actions recommandees) et interdictions (tabous) pour chaque Odu",
        "Element (Feu, Eau, Air, Terre) et correspondances croisees avec Yi Jing et Geomancie",
        "Les 16 Odu Meji (principaux) ont un corpus plus fourni (5+ proverbes, 3+ versets)",
        "Script de seed : src/db/seeds/seed-ifa.ts",
        "Le seed est idempotent",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["data", "seed", "ifa", "major"],
      "dependsOn": ["US-001"],
      "notes": "Story la plus volumineuse. 256 Odu x (signification + proverbes + versets) = corpus consequent (1-3 Mo). Sources de reference : William Bascom 'Ifa Divination', Wande Abimbola 'Ifa: An Exposition of Ifa Literary Corpus', Awo Fa'lokun Fatunmbi. Les 16 Odu Meji (Eji Ogbe, Oyeku Meji, Iwori Meji, etc.) sont les principaux et meritent un corpus plus fourni. Generation assistee par LLM recommandee avec validation manuelle des 16 Meji."
    },
    {
      "id": "US-008",
      "title": "Creer et seeder la Geomancie arabe (16 figures)",
      "description": "En tant qu'utilisateur, je veux que les 16 figures de la geomancie arabe (Ilm al-Raml) soient integrees avec leurs correspondances planetaires, zodiacales et elementaires, y compris la logique de combinaison par XOR pour calculer le Juge, afin d'exploiter naturellement les 4 bits (nibble) de chaque octet.",
      "acceptanceCriteria": [
        "16 figures seedes avec : numero (0-15), nom arabe original, nom latin medieval, signature binaire (4 caracteres, representant les 4 niveaux Tete/Cou/Corps/Pieds)",
        "Chaque figure a : element, planete, signe zodiacal, signification generale (100-150 mots), signification inversee",
        "Role dans les maisons (Juge, Temoin Droit, Temoin Gauche, Sentence) documente",
        "La logique de combinaison XOR (GF(2)^4) est decrite : Figure Mere 1 XOR Figure Mere 2 = Figure Fille, etc.",
        "Correspondances croisees avec les 4 Elements et les principes hermetiques",
        "Script de seed : src/db/seeds/seed-geomancy.ts",
        "Le seed est idempotent",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["data", "seed", "geomancy"],
      "dependsOn": ["US-001"],
      "notes": "16 figures seulement — story de volume modere. Le XOR est l'operation fondamentale de la geomancie : 2 figures meres (2 nibbles = 2x4 bits) produisent par XOR une figure fille, et les combinaisons successives produisent le Juge et la Sentence. Les 16 figures classiques : Puer, Amissio, Albus, Populus, Fortuna Major, Conjunctio, Puella, Rubeus, Acquisitio, Carcer, Tristitia, Laetitia, Cauda Draconis, Caput Draconis, Fortuna Minor, Via."
    },
    {
      "id": "US-009",
      "title": "Creer et seeder les Runes Elder Futhark (24 runes)",
      "description": "En tant qu'utilisateur, je veux que les 24 runes de l'Elder Futhark soient integrees avec leurs 3 Aettir, signification droite et inversee (merkstave), correspondances elementaires et divines, afin d'exploiter 5 bits QRNG pour adresser les 24 runes plus un bit d'orientation.",
      "acceptanceCriteria": [
        "24 runes seedes avec : numero (0-23), nom proto-germanique, glyphe Unicode (si disponible, sinon ASCII), valeur phonetique, numero d'Aett (1 = Freya, 2 = Heimdall, 3 = Tyr)",
        "Chaque rune a : signification droite (150+ mots), signification merkstave/inversee (100+ mots), element, divinite associee",
        "Correspondances elementaires et saisonnieres renseignees",
        "Les 9 runes non-reversibles sont identifiees (champ boolean is_reversible)",
        "Description du poeme runique associe (reference aux 3 poemes : norvegien, islandais, anglo-saxon)",
        "Script de seed : src/db/seeds/seed-runes.ts",
        "Le seed est idempotent",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["data", "seed", "runes"],
      "dependsOn": ["US-001"],
      "notes": "24 runes reparties en 3 Aettir de 8. Aett 1 (Freya) : Fehu, Uruz, Thurisaz, Ansuz, Raidho, Kenaz, Gebo, Wunjo. Aett 2 (Heimdall) : Hagalaz, Nauthiz, Isa, Jera, Eihwaz, Perthro, Algiz, Sowilo. Aett 3 (Tyr) : Tiwaz, Berkano, Ehwaz, Mannaz, Laguz, Ingwaz, Dagaz, Othala. Les 9 non-reversibles : Gebo, Hagalaz, Nauthiz, Isa, Jera, Eihwaz, Sowilo, Ingwaz, Dagaz."
    },
    {
      "id": "US-010",
      "title": "Creer et seeder l'Alchimie (4 stades + 7 operations)",
      "description": "En tant qu'utilisateur, je veux que les 4 stades du Grand Oeuvre (Nigredo, Albedo, Citrinitas, Rubedo) et les 7 operations alchimiques soient integres avec leurs correspondances planetaires et symboliques, afin d'exploiter 2 bits pour le stade et 3 bits pour l'operation.",
      "acceptanceCriteria": [
        "4 stades seedes avec : nom francais, nom latin, couleur, planete/astre, symbolisme (150+ mots), correspondance psychologique (Jung), matiere premiere associee",
        "7 operations seedes avec : nom francais, nom latin, planete, description du processus (150+ mots), stade parent (FK), correspondance avec le principe hermetique",
        "Correspondances croisees avec les 7 principes hermetiques (1 operation = 1 principe)",
        "Correspondances avec les 7 metaux traditionnels (Plomb, Etain, Fer, Or, Cuivre, Mercure, Argent)",
        "Script de seed : src/db/seeds/seed-alchemy.ts",
        "Le seed est idempotent",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["data", "seed", "alchemy"],
      "dependsOn": ["US-001"],
      "notes": "4 stades : Nigredo (noir, Saturne, putrefaction), Albedo (blanc, Lune, purification), Citrinitas (jaune, Soleil, eveil), Rubedo (rouge, Soleil/Mars, accomplissement). 7 operations : Calcination (Belier/Mars), Dissolution (Cancer/Lune), Separation (Scorpion/Pluton), Conjunction (Taureau/Venus), Fermentation (Capricorne/Saturne), Distillation (Vierge/Mercure), Coagulation (Sagittaire/Jupiter). Jung a mappe les stades sur l'individuation : ombre, anima/animus, Soi."
    },
    {
      "id": "US-011",
      "title": "Creer et seeder Chakras et Frequences Solfege",
      "description": "En tant qu'utilisateur, je veux que les 7 chakras principaux et les 9 frequences sacrees du Solfege soient integres avec leurs correspondances energetiques, afin que la racine numerique de l'octet QRNG adresse directement un chakra et une frequence.",
      "acceptanceCriteria": [
        "7 chakras seedes avec : nom sanskrit, nom francais, localisation corporelle, couleur, element, mantra (bija), frequence solfege associee, fonction (physique + spirituelle), description (150+ mots), symptomes de blocage/ouverture",
        "9 frequences solfege seedes (174, 285, 396, 417, 528, 639, 741, 852, 963 Hz) avec : nom, racine numerique (3, 6 ou 9), description de l'effet, propriete de guerison/harmonisation",
        "Correspondances croisees chakra <-> element <-> planete <-> couleur <-> note musicale",
        "La logique de mapping est documentee : racine numerique de l'octet → frequence solfege, puis octet % 7 → chakra",
        "Script de seed : src/db/seeds/seed-chakras.ts",
        "Le seed est idempotent",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["data", "seed", "chakras", "solfege"],
      "dependsOn": ["US-001"],
      "notes": "7 chakras : Muladhara (racine, rouge, Terre), Svadhisthana (sacre, orange, Eau), Manipura (plexus solaire, jaune, Feu), Anahata (coeur, vert, Air), Vishuddha (gorge, bleu, Ether), Ajna (3e oeil, indigo, Lumiere), Sahasrara (couronne, violet, Pensee). 9 frequences solfege : 174, 285, 396, 417, 528 (frequence de l'amour), 639, 741, 852, 963 Hz. Toutes ont une racine numerique de 3, 6 ou 9 (la triade de Tesla)."
    },
    {
      "id": "US-012",
      "title": "Creer et seeder la Gematria hebraique (22 lettres + algorithme de decomposition)",
      "description": "En tant qu'utilisateur, je veux que les 22 lettres hebraiques soient integrees avec leurs valeurs numeriques et que tout octet (0-255) puisse etre decompose en une somme de lettres hebraiques formant un nom sacre, afin de reveler la dimension gematrique du signal quantique.",
      "acceptanceCriteria": [
        "22 lettres hebraiques seedes avec : numero (1-22), glyphe hebreu, nom (Aleph, Beth...), valeur phonetique, valeur numerique standard (1-400), signification symbolique (100+ mots), categorie (3 meres / 7 doubles / 12 simples), chemin sur l'Arbre de Vie (FK vers kabbalah_paths)",
        "Algorithme decomposeGematria(value: number): HebrewLetter[] implemente dans le DAL",
        "L'algorithme utilise la decomposition gourmande (greedy) : prend la plus grande valeur de lettre possible en descendant (400, 300, 200, 100, 90, 80... 1)",
        "Chaque decomposition produit un mot sacre lisible (concatenation des glyphes)",
        "La somme des valeurs des lettres retournees egale exactement la valeur d'entree",
        "Valeurs speciales documentees (26 = YHVH, 72 = Shem HaMephorash, etc.)",
        "Script de seed : src/db/seeds/seed-gematria.ts",
        "Le seed est idempotent",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["data", "seed", "gematria", "kabbalah"],
      "dependsOn": ["US-001", "US-005"],
      "notes": "Les 22 lettres ont des FK vers kabbalah_paths (US-005). Valeurs numeriques : Aleph(1) Beth(2) Gimel(3) Daleth(4) He(5) Vav(6) Zayin(7) Cheth(8) Teth(9) Yod(10) Kaph(20) Lamed(30) Mem(40) Nun(50) Samekh(60) Ayin(70) Pe(80) Tsade(90) Qoph(100) Resh(200) Shin(300) Tav(400). L'algorithme greedy pour 255 : 200(Resh) + 50(Nun) + 5(He) = רנה = 'joie/chant'."
    },
    {
      "id": "US-013",
      "title": "Mettre a jour le QRNG pour demander 16 octets",
      "description": "En tant que developpeur, je veux que le systeme QRNG demande 16 octets au lieu de 8 afin de disposer de 128 bits pour adresser les 13 traditions sans chevauchement ni reutilisation de bits.",
      "acceptanceCriteria": [
        "La constante CONFIG.quantumBytes dans src/app/api/consult/route.ts passe de 8 a 16",
        "Le provider LfD demande correctement 16 octets (parametre length=16)",
        "Le provider NIST retourne suffisamment de donnees (son beacon fournit 64 octets, pas de changement necessaire)",
        "Le fallback Web Crypto genere 16 octets",
        "La validation dans calculateEsotericReading accepte un minimum de 16 octets",
        "La deduplication de requetes (pendingRequests) fonctionne toujours correctement",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 1,
      "passes": false,
      "labels": ["backend", "qrng", "foundation"],
      "dependsOn": [],
      "notes": "Changement minimal mais fondamental. Fichiers concernes : src/app/api/consult/route.ts (CONFIG.quantumBytes), src/lib/qrng/index.ts (pas de changement si le parametre length est deja dynamique), src/lib/esoteric.ts (validation bytes.length >= 16). Le NIST Beacon fournit 512 bits = 64 octets donc largement suffisant. Le LfD accepte un parametre length arbitraire."
    },
    {
      "id": "US-014",
      "title": "Refondre le moteur d'interpretation en mapping bit-par-bit natif",
      "description": "En tant que developpeur, je veux remplacer le moteur calculateEsotericReading actuel (base sur sum % N) par un moteur qui lit directement les bits des 16 octets QRNG pour adresser chaque tradition a son echelle native, afin que la structure binaire du signal quantique soit preservee et que chaque tradition recoive ses bits dedies.",
      "acceptanceCriteria": [
        "Le fichier src/lib/esoteric.ts est refactore avec le nouveau moteur",
        "Plan d'allocation des bits documente dans un commentaire en tete de fichier",
        "Octet 0 (8 bits) : Ifa Odu (256 signes, mapping 1:1)",
        "Octet 1 bits 0-5 (6 bits) : Yi Jing hexagramme (64, via 2 trigrammes de 3 bits)",
        "Octet 1 bits 6-7 + Octet 2 bits 0-3 (6 bits) : Yi Jing lignes mutantes",
        "Octet 2 bits 4-7 (4 bits) : Geomancie figure mere 1",
        "Octet 3 bits 0-3 (4 bits) : Geomancie figure mere 2",
        "Octet 3 bits 4-7 + Octet 4 bit 0 (5 bits) : Tarot arcane majeur (0-21 sur 0-31)",
        "Octet 4 bits 1-5 (5 bits) : Kabbale (10 Sefirot + 22 chemins sur 0-31)",
        "Octet 4 bits 6-7 + Octet 5 bit 0 (3 bits) : Hermetisme principe (0-6 sur 0-7)",
        "Octet 5 bits 1-5 (5 bits) : Elder Futhark rune (0-23 sur 0-31) + Octet 5 bit 6 : orientation",
        "Octet 5 bit 7 + Octet 6 bits 0-1 (2 bits) : Alchimie stade (0-3)",
        "Octet 6 bits 2-4 (3 bits) : Alchimie operation (0-6 sur 0-7)",
        "Octet 6 bits 5-7 (3 bits) : Chakra (0-6 sur 0-7)",
        "Octet 7 (8 bits) : Gematria — valeur brute decomposee en lettres hebraiques",
        "Octets 8-11 (4 octets) : Elements — 1 octet par element, distribution proportionnelle",
        "Octets 12-13 (2 octets) : Geometrie sacree — ratios consecutifs vs Phi",
        "Octets 14-15 (2 octets) : Synthese — energie, polarite, phase, ton cosmique",
        "Pour les traditions a cardinalite non-puissance-de-2 (Tarot 22, Runes 24, Hermetisme 7, Alchimie operation 7, Chakra 7), le mapping utilise un scaling plutot qu'un modulo biaise",
        "Fonctions utilitaires d'extraction de bits : extractBits(bytes, startBit, numBits): number",
        "Le moteur lit les donnees depuis le DAL (US-002) au lieu des constantes TypeScript",
        "L'interface QuantumEsotericReading est etendue avec les 6 nouvelles traditions",
        "La fonction generateEsotericContext est mise a jour pour inclure toutes les traditions dans le texte envoye au LLM",
        "Chaque tradition recoit des bits dedies — aucun bit n'est utilise par deux traditions (sauf Elements/Geometrie/Synthese qui utilisent des octets entiers)",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 1,
      "passes": false,
      "labels": ["backend", "engine", "core"],
      "dependsOn": ["US-002", "US-013"],
      "notes": "Story la plus critique techniquement. Le moteur actuel dans src/lib/esoteric.ts utilise sum % 22 (Tarot), (sum % 10) + 1 (Kabbale), (sum % 7) + 1 (Hermetisme). Seul le Yi Jing utilise deja une extraction de bits (b & 1). Le nouveau moteur doit extraire les bits directement avec une fonction extractBits qui traverse les frontieres d'octets. Pour le scaling non-biaise : Math.floor(rawValue * targetRange / sourceRange) — ex: Tarot = Math.floor(raw5bits * 22 / 32). Biais residuel < 3%, acceptable."
    },
    {
      "id": "US-015",
      "title": "Implementer le systeme de correspondances croisees entre traditions",
      "description": "En tant qu'utilisateur, je veux que les traditions soient liees entre elles par des correspondances authentiques (ex: Arcane du Tarot <-> Chemin kabbalistique <-> Lettre hebraique <-> Signe zodiacal), afin de reveler la coherence profonde entre les differents systemes.",
      "acceptanceCriteria": [
        "La table tradition_correspondences est peuplee avec les correspondances canoniques",
        "22 Arcanes <-> 22 Chemins <-> 22 Lettres hebraiques (tradition Golden Dawn)",
        "7 Principes hermetiques <-> 7 Operations alchimiques <-> 7 Planetes <-> 7 Metaux <-> 7 Chakras",
        "4 Elements <-> 4 Stades alchimiques <-> 4 directions <-> 4 saisons",
        "12 Signes zodiacaux <-> 12 Lettres simples <-> Elements",
        "Odu Ifa <-> Hexagramme Yi Jing (correspondances via la signature binaire partagee pour les 6 premiers bits)",
        "Figures geomantiques <-> Elements <-> Planetes",
        "Runes <-> Elements <-> Saisons",
        "Fonction getReadingCorrespondences(reading: QuantumEsotericReading) qui extrait toutes les correspondances croisees entre les traditions obtenues",
        "Le resultat met en evidence les resonances : quand plusieurs traditions pointent vers le meme element, planete ou archetype, c'est signale comme une convergence significative",
        "Script de seed : src/db/seeds/seed-correspondences.ts",
        "Le seed est idempotent",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["backend", "correspondences", "data"],
      "dependsOn": ["US-003", "US-004", "US-005", "US-006", "US-007", "US-008", "US-009", "US-010", "US-011", "US-012", "US-014"],
      "notes": "Depend de tous les seeds car les correspondances referencent toutes les tables. La fonction getReadingCorrespondences est le coeur de la valeur ajoutee : elle detecte les convergences (ex: si le Tarot donne Le Chariot (Cancer), le Chakra donne Manipura (Feu), et l'Element dominant est Feu — c'est une convergence Feu signalée comme resonance forte)."
    },
    {
      "id": "US-016",
      "title": "Mettre a jour les prompts LLM (Mistral + Ollama)",
      "description": "En tant qu'utilisateur, je veux que les prompts envoyes au LLM incluent la richesse des 13 traditions et les correspondances croisees, afin que la reponse oraculaire soit profonde, multidimensionnelle et ancree dans les symboles reveles.",
      "acceptanceCriteria": [
        "Le system prompt Mistral (src/lib/mistral/prompts.ts) mentionne les 13 traditions (pas seulement 4)",
        "Le system prompt ajoute le cadre philosophique (Ordre Implique, It from Bit)",
        "La limite de mots est evaluee et augmentee si necessaire (50 → 80-100 mots)",
        "Le buildUserPrompt inclut dans le contexte esoterique : Ifa Odu, Geomancie, Rune, Alchimie, Chakra, Gematria, et les convergences croisees detectees",
        "Le system prompt Ollama (src/lib/ollama/prompts.ts) est mis a jour de maniere symetrique",
        "La generateEsotericContext dans src/lib/esoteric.ts produit un texte structure incluant les 13 traditions",
        "Le prompt reste efficace — les informations sont hierarchisees avec les convergences en premier",
        "Le ton mystique mais accessible est conserve, reponse en francais",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["backend", "llm", "prompts"],
      "dependsOn": ["US-014", "US-015"],
      "notes": "Le prompt actuel fait ~200 tokens de contexte esoterique. Avec 13 traditions + convergences, il faudra etre selectif pour ne pas noyer le LLM. Strategie recommandee : mettre les convergences en premier (elles sont le signal fort), puis chaque tradition en 1 ligne (nom + valeur + sens court), puis le detail complet pour les 2-3 traditions les plus convergentes. Le system prompt Mistral est dans src/lib/mistral/prompts.ts, l'Ollama dans src/lib/ollama/prompts.ts."
    },
    {
      "id": "US-017",
      "title": "Mettre a jour la route API /api/consult",
      "description": "En tant que developpeur, je veux que la route API retourne la lecture enrichie avec les 13 traditions et les correspondances, afin que le frontend ait toutes les donnees necessaires pour la nouvelle UI.",
      "acceptanceCriteria": [
        "CONFIG.quantumBytes est a 16",
        "L'objet esotericReading dans la reponse JSON inclut les 6 nouvelles traditions : ifa, geomancy, runes, alchemy, chakras, gematria",
        "Les correspondances croisees sont incluses : correspondences: { convergences: [], links: [] }",
        "Le champ quantumData.numbers retourne un tableau de 16 elements",
        "La retrocompatibilite est maintenue pour les consultations existantes en base (les anciennes lectures a 8 octets restent lisibles)",
        "Le type ResponseData est mis a jour",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["backend", "api"],
      "dependsOn": ["US-014", "US-015"],
      "notes": "Fichier : src/app/api/consult/route.ts. La retrocompatibilite est importante : les anciennes consultations stockent quantumData en JSON string avec 8 octets. Le frontend doit pouvoir afficher ces anciennes lectures sans erreur (les nouvelles traditions seront simplement absentes). Le type EsotericReading dans src/types/esoteric.ts doit rendre les nouvelles traditions optionnelles (?)."
    },
    {
      "id": "US-018",
      "title": "Reorganiser l'architecture des onglets UI",
      "description": "En tant qu'utilisateur, je veux que l'affichage des resultats soit reorganise en onglets refletant la nouvelle architecture en couches de lecture (signal brut → traditions divinatoires → sagesse esoterique → resonances → synthese), afin de naviguer intuitivement dans la richesse de l'interpretation.",
      "acceptanceCriteria": [
        "L'ancien systeme a 3 onglets (Synthesis, Technical, Traditions) est remplace par une nouvelle architecture",
        "Nouvel onglet Signal Quantique : octets bruts (hex + decimal), visualisation binaire bit-par-bit montrant quel bit alimente quelle tradition, statistiques, source QRNG",
        "Nouvel onglet Traditions Divinatoires : Yi Jing (hexagramme + trigrammes + lignes mutantes), Ifa (Odu + proverbe + Orisha), Geomancie (figures + juge), Elder Futhark (rune + orientation + Aett)",
        "Nouvel onglet Sagesse Esoterique : Tarot (arcane + symbolisme), Kabbale (Sefirah + chemin), Hermetisme (principe + axiome), Alchimie (stade + operation)",
        "Nouvel onglet Resonances : Elements (distribution + dominant), Chakras (chakra + frequence solfege + mantra), Geometrie Sacree (Phi resonance + Fibonacci), Gematria (mot sacre + decomposition)",
        "Nouvel onglet Synthese de l'Ordre Implique : energie cosmique, polarite, phase, ton cosmique, carte des convergences croisees entre traditions",
        "Chaque tradition affiche un lien Voir le calcul (details) montrant les bits extraits et le mapping",
        "Navigation fluide entre onglets (animation de transition)",
        "Responsive : onglets scrollables horizontalement sur mobile",
        "Les types EsotericReading et QuantumData dans src/types/esoteric.ts sont mis a jour pour les 13 traditions",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 3,
      "passes": false,
      "labels": ["frontend", "ui", "tabs"],
      "dependsOn": ["US-017"],
      "notes": "Remplacement des 3 composants existants : src/components/home/tabs/SynthesisTab.tsx, TechnicalTab.tsx, TraditionsTab.tsx. Le design system existant utilise : bg-white/40 backdrop-blur-sm, border-slate-100, rounded-2xl, font-mono uppercase tracking-[0.15em] pour les labels, text-[10px] pour les sous-titres, details/summary pour les calculs collapsibles. Utiliser les memes Tooltip et HelpIcon de src/components/ui/Tooltip."
    },
    {
      "id": "US-019",
      "title": "Implementer les composants UI des nouvelles traditions",
      "description": "En tant qu'utilisateur, je veux des composants visuels dedies pour chaque nouvelle tradition (Ifa, Geomancie, Runes, Alchimie, Chakras, Gematria), coherents avec le design system existant.",
      "acceptanceCriteria": [
        "Composant IfaCard : nom de l'Odu, signature binaire (8 points), Orisha patron, proverbe Yoruba en italique, signification. Design avec border-amber",
        "Composant GeomancyCard : 2 figures meres (representation visuelle des 4 niveaux en points), figure Juge (XOR), element + planete. Design avec border-rose",
        "Composant RuneCard : glyphe de la rune (grande taille), nom + Aett, signification (droite ou merkstave selon bit d'orientation), element + divinite. Design avec border-cyan",
        "Composant AlchemyCard : stade (avec couleur : noir/blanc/jaune/rouge) + operation, planete + metal, symbolisme. Design avec border-yellow",
        "Composant ChakraCard : chakra (nom sanskrit + couleur), localisation, mantra, frequence solfege (Hz), barre de frequence coloree. Design avec border-indigo",
        "Composant GematriaCard : valeur numerique, mot sacre en hebreu (grande taille), decomposition lettre par lettre avec valeurs. Design avec border-sky",
        "Composant ConvergenceMap : correspondances croisees entre traditions, convergences mises en evidence. Design avec gradient",
        "Tous les composants suivent le pattern existant : card avec bg-white/40 backdrop-blur-sm border rounded-2xl, titres en font-mono uppercase, details collapsibles",
        "Chaque composant est dans src/components/home/tabs/cards/",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 3,
      "passes": false,
      "labels": ["frontend", "ui", "components"],
      "dependsOn": ["US-018"],
      "notes": "7 composants a creer. Les composants existants pour reference : TraditionsTab.tsx contient les cards I Ching (border-amber-100/40), Tarot (border-violet-100/40), Kabbalah (border-blue-100/40), Hermetic (border-emerald-100/40). Suivre le meme pattern avec des couleurs distinctes pour chaque nouvelle tradition. Le ConvergenceMap est le composant le plus complexe — il doit visualiser les liens entre traditions."
    },
    {
      "id": "US-020",
      "title": "Creer le runner de seed global et la documentation",
      "description": "En tant que developpeur, je veux un script unique pour seeder toutes les tables esoteriques et une documentation decrivant le plan d'allocation des bits, afin de pouvoir initialiser la base en une commande et comprendre l'architecture.",
      "acceptanceCriteria": [
        "Script src/db/seeds/index.ts qui execute tous les seeds dans l'ordre correct (respect des FK)",
        "Ordre d'execution : 1.Elements, 2.Hermetic, 3.Sefirot, 4.Paths, 5.Tarot, 6.Trigrams+Hexagrams, 7.Ifa, 8.Geomancy, 9.Runes, 10.Alchemy Stages+Operations, 11.Chakras+Solfege, 12.Hebrew Letters, 13.Correspondences",
        "Commande bun run db:seed ajoutee dans package.json",
        "Le runner affiche la progression (table par table) et le nombre d'entrees inserees",
        "Tous les seeds sont transactionnels (rollback si erreur)",
        "Commentaire detaille en tete de src/lib/esoteric.ts documentant le plan d'allocation des 128 bits avec les traditions adressees",
        "Quality gate: bun run typecheck && bun run lint && bun run build"
      ],
      "priority": 2,
      "passes": false,
      "labels": ["backend", "tooling", "seed"],
      "dependsOn": ["US-003", "US-004", "US-005", "US-006", "US-007", "US-008", "US-009", "US-010", "US-011", "US-012"],
      "notes": "Le runner doit orchestrer les seeds dans l'ordre des FK. Les seeds individuels sont crees dans US-003 a US-012 et US-015. Ce runner les importe et les execute sequentiellement dans une transaction globale. Ajouter un script dans package.json : \"db:seed\": \"bun run src/db/seeds/index.ts\"."
    }
  ],
  "metadata": {
    "qualityGates": [
      "bun run typecheck",
      "bun run lint",
      "bun run build"
    ],
    "prdSource": "prd-esoteric-engine-overhaul.md",
    "totalTraditions": 13,
    "existingTraditions": ["Yi Jing", "Tarot", "Kabbalah", "Hermetisme", "Elements", "Geometrie Sacree", "Synthese"],
    "newTraditions": ["Ifa", "Geomancie", "Elder Futhark", "Alchimie", "Chakras/Solfege", "Gematria"],
    "qrngBytes": 16,
    "totalBits": 128
  }
}
